Repository: OTRS/TimeAccounting
Catalog: doc/i18n/doc-TimeAccounting.*.po
Languages: hu

source: en
hu: hu

source: <edition>$Description Version $Version</edition> <copyright> <year>$YearStamp</year> <holder>$Vendor, $URL</holder> </copyright> <date>$DateStamp</date>
hu: <edition>$Description, verzió: $Version</edition> <copyright> <year>$YearStamp</year> <holder>$Vendor, $URL</holder> </copyright> <date>$DateStamp</date>

source: This work is copyrighted by $Vendor, Norsk-Data-Str. 1, 61352 Bad Homburg, Germany.
hu: Ez a mű az alábbi gyártó szerzői joga alatt áll: $Vendor, Norsk-Data-Str. 1, 61352 Bad Homburg, Németország.

source: Build Date: $DateStamp
hu: Összeállítás dátuma: $DateStamp

source: Preface
hu: Előszó

source: TimeAccounting module extends OTRS framework enabling the track of time that agents spend on different tasks, vacations, overtime and sick leaves.
hu: A TimeAccounting modul az OTRS keretrendszert bővíti ki lehetővé téve annak követését, hogy az ügyintézők mennyi időt töltenek a különböző feladatokkal, szabadságokkal, túlórákkal és betegszabadságokkal.

source: If you have questions regarding this document or if you need further information, please log in to our customer portal at portal.otrs.com with your OTRS ID and create a ticket. You do not have an OTRS ID yet? Register <ulink url="https://portal.otrs.com/otrs/customer.pl#Signup">here for free</ulink>.
hu: Ha kérdései vannak ezzel a dokumentummal kapcsolatban, vagy további információkra van szüksége, akkor lépjen be az OTRS azonosítójával a portal.otrs.com címen lévő ügyfélportálunkra, és hozzon létre egy jegyet. Még nincs OTRS azonosítója? Regisztráljon <ulink url="https://portal.otrs.com/otrs/customer.pl#Signup">itt ingyenesen</ulink>.

source: Feature List
hu: Funkciólista

source: Time Accounting Overview
hu: Időelszámolás áttekintése

source: It displays for the current logged user a summary of its own working hours per day (month based), vacation days summary, sick leave days, and the distribution of its working hours on each project and tasks.
hu: Megjeleníti a jelenleg bejelentkezett felhasználónak a saját napi munkaideje összegzését (havi alapon), a szabadságon eltöltött napok és a betegszabadságok eltöltött napok összegzését, valamint az egyes projekteken és feladatokon vett munkaidő eloszlását.

source: Time Accounting Edit
hu: Időelszámolás szerkesztése

source: Allows to set working hours, vacation, sick leaves and overtime leaves on a day basis. The working hours can be set by defining the start and the end dates, or a period of time.
hu: Lehetővé teszi a munkaidő, szabadságok, betegszabadságok és csúsztatások beállítását napi alapokon. A munkaidő beállítható a kezdési és a befejezési dátumok vagy egy időszak meghatározásával.

source: The working hours can be registered per project and task. Pre-filled selection lists are used to speedup the register process and prevent typos.
hu: A munkaidő regisztrálható projektenként vagy feladatonként. Előre kitöltött választólisták használhatók a regisztrálási folyamat gyorsításához és a helyesírási hibák kiküszöböléséhez.

source: Time Accounting Reporting
hu: Időelszámolás jelentése

source: Designed for administrators and managers, shows a monthly based timing information summary for each registered user (working hours, overtime leave, sick leave and vacations), as well as timing information summary for each project and tasks (the time spend on each).
hu: Adminisztrátoroknak és menedzsereknek tervezve jeleníti meg a havi alapú időszámítási információk összegzését az egyes regisztrált felhasználókhoz (munkaidő, csúsztatások, betegszabadságok és szabadságok). Valamint megjeleníti az időszámítási információk összegzését az egyes projektekhez és feladatokhoz is (a velük eltöltött időt).

source: Time Accounting Settings
hu: Időelszámolás beállítások

source: Also designed for administrators and managers, it allows the creation of multiple projects and tasks. It also enables the assignment of the users defining their working calendar, working periods (begin date, end date, number of vacation days, hours per week and allowed overtime hours).
hu: Szintén adminisztrátoroknak és menedzsereknek tervezve teszi lehetővé több projekt és feladat létrehozását. Megengedi továbbá a felhasználók beosztását saját naptárak és munkaidőszakok (kezdési dátum, befejezési dátum, szabadságon eltöltött napok száma, heti órák és megengedett túlórák) meghatározásával.

source: Time Accounting Statistics
hu: Időelszámolás statisztikák

source: A new statistics type has been added to show working hours based on projects or users.
hu: Egy új statisztikatípus került hozzáadásra a munkaidő megjelenítéséhez projektek vagy felhasználók alapján.

source: Time Accounting Notification
hu: Időelszámolás értesítés

source: A notification reminder for agents to insert their working hours (can be configured in SysConfig to define the maximum days without entry to display the notification).
hu: Egy emlékeztető értesítés az ügyintézőknek a munkaidejük beillesztéséhez (a rendszerbeállításokban állítható be a legtöbb bejegyzés nélküli nap meghatározása az értesítés megjelenítéséhez).

source: Toolbar Shortcut For Days Without Time Accounting Entry
hu: Eszköztárikon az időelszámolási bejegyzés nélküli napokhoz

source: A counter displaying the number of days without registering the working hours can be set in the upper part of the screen (similar to Locked tickets counter or Responsible tickets counter). When clicking on the icon, agents are redirected to the Time Accounting Edit screen, to fill the missing records.
hu: A munkaidő regisztrálása nélküli napok számát megjelenítő számláló állítható be a képernyő felső részén (hasonlóan a zárolt jegyek vagy a felelős jegyek számlálóihoz). Az ikonra kattintva az ügyintézők átirányításra kerülnek az időelszámolás szerkesztése képernyőre a hiányzó feljegyzések kitöltéséhez.

source: Time Accounting Registration Enforcement
hu: Időelszámolás regisztrálásának kikényszerítése

source: Configurable by a SysConfig setting, the system can be blocked, not allowing to perform any actions, if a certain number of days without time accounting registers has been passed (agents are redirected to Time Accounting Edit screen to fill the missing records).
hu: Egy rendszerbeállítási lehetőséggel beállítható, hogy a rendszer blokkolva legyen, ne tegye lehetővé semmilyen művelet végrehajtását, ha az időelszámolási regisztrálások nélküli napoknak egy bizonyos számát meghaladják (az ügyintézők átirányításra kerülnek az időelszámolás szerkesztése képernyőre a hiányzó feljegyzések kitöltéséhez).

source: Mass Entries
hu: Tömeges bejegyzések

source: Disabled by default, this feature allows agents to set special time accounting information (such as: on vacation, overtime leaves and sick leave) to multiple days at the same time.
hu: Alapértelmezett le van tiltva. Ez a funkció lehetővé teszi az ügyintézőknek a különleges időelszámolási információk (mint például szabadság, csúsztatás és betegszabadság) beállítását egyszerre több napra.

source: System Requirements
hu: Rendszerkövetelmények

source: Framework
hu: Keretrendszer

source: The following OTRS framework is required:
hu: A következő OTRS keretrendszer szükséges:

source: Packages
hu: Csomagok

source: The following packages are required:
hu: A következő csomagok szükségesek:

source: Operating System
hu: Operációs rendszer

source: This package requires one of the following operating systems:
hu: Ez a csomag a következő operációs rendszerek egyikét igényli:

source: Third Party Software
hu: Harmadik féltől származó szoftver

source: This third party software is required to use this package:
hu: Ez a harmadik féltől származó szoftver szükséges a csomag használatához:

source: None.
hu: Nincs.

source: Installation
hu: Telepítés

source: The following instructions explain how to install the package.
hu: A következő lépések elmagyarázzák, hogy hogyan kell telepíteni a csomagot.

source: After having successfully completed the installation, please follow the instructions provided in the chapter &quot;First steps&quot;.
hu: Miután sikeresen befejezte a telepítést, kövesse az „Első lépések” fejezetben leírt utasításokat.

source: Admin Interface
hu: Adminisztrátori felület

source: Please use the following URL to install the package utilizing the Admin Interface (please note that you need to be in the "admin" group).
hu: Használja a következő URL-t a csomag telepítéséhez, hogy használhassa az adminisztrátori felületet (ne feledje, hogy az „admin” csoportban kell lennie).

source: Command Line
hu: Parancssor

source: Whenever you cannot use the Admin Interface for whatever reason, you may use the following command line tool ("bin/otrs.Console.pl Admin::Package::Install") instead.
hu: Ha esetleg valamilyen okból nem tudja használni az adminisztrátori felületet, akkor használhatja a következő parancssori eszközt helyette („bin/otrs.Console.pl Admin::Package::Install”).

source: Configuration
hu: Beállítás

source: The package can be configured via the SysConfig in the Admin Interface. The following configuration options are available:
hu: A csomag a rendszerbeállításokon keresztül állítható be az adminisztrátori felületen. A következő beállítási lehetőségek érhetők el:

source: Group: TimeAccounting, Subgroup: Frontend::Agent::ModuleRegistration.
hu: Csoport: TimeAccounting, alcsoport: Frontend::Agent::ModuleRegistration.

source: Frontend module registration for the agent interface.
hu: Előtétprogram-modul regisztráció az ügyintézői felülethez.

source: Group: TimeAccounting, Subgroup: Frontend::Agent::ModuleNotify.
hu: Csoport: TimeAccounting, alcsoport: Frontend::Agent::ModuleNotify.

source: This notification module gives a warning if there are too many incomplete working days.
hu: Ez az értesítési modul egy figyelmeztetést ad, ha túl sok befejezetlen munkanap található.

source: Group: TimeAccounting, Subgroup: Frontend::Agent::ToolBarModule.
hu: Csoport: TimeAccounting, alcsoport: Frontend::Agent::ToolBarModule.

source: Agent interface notification module to see the number of incomplete working days for the user.
hu: Ügyintézői felület értesítési modul a felhasználó befejezetlen munkanapjai számának megtekintéséhez.

source: Group: TimeAccounting, Subgroup: Frontend::Agent.
hu: Csoport: TimeAccounting, alcsoport: Frontend::Agent.

source: This module forces inserts in TimeAccounting.
hu: Ez a modul kikényszeríti a beszúrásokat az időelszámolásban.

source: Group: TimeAccounting, Subgroup: Core::Stats.
hu: Csoport: TimeAccounting, alcsoport: Core::Stats.

source: Determines if the statistics module may generate time accounting information.
hu: Meghatározza, hogy a statisztika modul előállíthat-e időelszámolási információkat.

source: Group: TimeAccounting, Subgroup: Frontend::Agent::TimeAccounting::ViewEdit.
hu: Csoport: TimeAccounting, alcsoport: Frontend::Agent::TimeAccounting::ViewEdit.

source: Regular expressions for constraining action list according to selected project. Key contains regular expression for project(s), content contains regular expressions for action(s).
hu: Reguláris kifejezések a kijelölt projekt szerinti korlátozó művelet listájához. A kulcs a projektekhez tartalmaz reguláris kifejezést, a tartalom pedig a műveletekhez.

source: If enabled, the filter for the previous projects is active by default if there are the previous projects. It could be used only if EnableAutoCompletion and TimeAccounting::UseFilter are enabled.
hu: Ha engedélyezve van, akkor az előző projektek szűrője alapértelmezetten be van kapcsolva, ha vannak előző projektek. Csak akkor használható, ha az EnableAutoCompletion és a TimeAccounting::UseFilter engedélyezve van.

source: If enabled, the user is allowed to enter &quot;on vacation leave&quot;, &quot;on sick leave&quot; and &quot;on overtime leave&quot; to multiple dates at once.
hu: Ha engedélyezve van, akkor a felhasználónak megengedett egyszerre több dátumhoz „szabadságon”, „betegszabadságon” és „csúsztatáson” érték megadása.

source: Group: TimeAccounting, Subgroup: Frontend::Agent::TimeAccounting::ViewSetting.
hu: Csoport: TimeAccounting, alcsoport: Frontend::Agent::TimeAccounting::ViewSetting.

source: Default name for new actions.
hu: Alapértelmezett név az új műveletekhez.

source: Default status for new actions.
hu: Alapértelmezett állapot az új műveletekhez.

source: Default name for new projects.
hu: Alapértelmezett név az új projektekhez.

source: Default status for new projects.
hu: Alapértelmezett állapot az új projektekhez.

source: Default setting for date end.
hu: Alapértelmezett beállítás a befejezési dátumhoz.

source: Default setting for date start.
hu: Alapértelmezett beállítás a kezdési dátumhoz.

source: Default setting for description.
hu: Alapértelmezett beállítás a leíráshoz.

source: Default setting for leave days.
hu: Alapértelmezett beállítás a szabadság napjaihoz.

source: Default setting for overtime.
hu: Alapértelmezett beállítás a túlórához.

source: Default status for new users.
hu: Alapértelmezett állapot az új felhasználókhoz.

source: Default setting for the standard weekly hours.
hu: Alapértelmezett beállítás a szabványos heti munkaórákhoz.

source: If enabled, the dropdown elements in the edit screen are changed to modernized autocompletion fields.
hu: Ha engedélyezve van, akkor a szerkesztési képernyőn lévő lenyíló elemek korszerűsített automatikusan kiegészített mezőkre lesznek megváltoztatva.

source: Group: TimeAccounting, Subgroup: Frontend::Agent::TimeAccoutning::ViewReportingProject.
hu: Csoport: TimeAccounting, alcsoport: Frontend::Agent::TimeAccoutning::ViewReportingProject.

source: If enabled, only users that has added working time to the selected project are shown.
hu: Ha engedélyezve van, akkor csak azok a felhasználók lesznek megjelenítve, akik munkaidőt adtak hozzá a kijelölt projekthez.

source: Specifies if working hours can be inserted without start and end times.
hu: Megadja, hogy a munkaidő beszúrható-e kezdési és befejezési idők nélkül.

source: For how many days ago you can insert working units.
hu: Hány nappal ezelőtthöz illeszthet be munkaegységeket.

source: Maximum number of working days after which the working units have to be inserted.
hu: A munkanapok legnagyobb száma, amelyek után a munkaegységeket be kell szúrni.

source: Maximum number of working days without working units entry after which a warning will be shown.
hu: A munkaegységek bejegyzés nélküli munkanapok legnagyobb száma, amelyek után egy figyelmeztetés lesz megjelenítve.

source: Defines the projects for which a remark is required. If the RegExp matches on the project, you have to insert a remark too. The RegExp use the smx parameter.
hu: Meghatározza azokat a projekteket, amelyekhez észrevétel szükséges. Ha a reguláris kifejezés illeszkedik a projektre, akkor be kell illesztenie egy észrevételt is. A reguláris kifejezés az smx paramétert használja.

source: Regular expressions for constraining project list according to user groups. Key contains regular expression for project(s), content contains comma separated list of groups.
hu: Reguláris kifejezések a felhasználócsoportok szerinti korlátozó projekt listájához. A kulcs a projektekhez tartalmaz reguláris kifejezést, a tartalom pedig csoportok vesszővel elválasztott listáját tartalmazza.

source: To use if some actions reduced the working hours (for example, if only half of the traveling time is paid Key =&gt; traveling; Content =&gt; 50).
hu: Akkor kell használni, ha néhány művelet csökkentette a munkaidőt (például ha csak az utazási idő fele van kifizetve: Kulcs =&gt; utazás; Tartalom =&gt; 50).

source: If enabled, the filter for the previous projects can be used instead two list of projects (last and all ones). It could be used only if TimeAccounting::EnableAutoCompletion is enabled.
hu: Ha engedélyezve van, akkor az előző projektek szűrője használható a projektek két listája helyett (legutóbbi és összes). Csak akkor használható, ha a TimeAccounting::EnableAutoCompletion engedélyezve van.

source: Usage
hu: Használat

source: This package adds a new group called "time_accouting". Depending on the permission over this group, agents are allowed to execute certain actions, in general having "rw" permission allows agents to use all screens while "ro" permissions only allows access to personal overview (Time Accounting Overview) and working hours registration (Time Accounting Edit) screens.
hu: Ez a csomag egy új „time_accouting” nevű csoportot ad hozzá. Ezen csoporton beállított jogosultságtól függően az ügyintézőknek lehetőségük van bizonyos műveletek végrehajtására. Általában az „írás-olvasás” jogosultság megléte teszi lehetővé az ügyintézőknek az összes képernyő használatát, míg a „csak olvasás” jogosultságok csak a személyes áttekintő (időelszámolás áttekintő) és a munkaidő regisztrálása (időelszámolás szerkesztése) képernyőkhöz teszik lehetővé a hozzáférést.

source: Create A New Project
hu: Új projekt létrehozása

source: This example shows how to create a new project to register working hours on.
hu: Ez a sablon azt mutatja be, hogy hogyan lehet új projektet létrehozni az azon történő munkaidő regisztrálásához.

source: For this and following examples a user with "rw" in "time_accouting" group is needed.
hu: Ennél és a következő példáknál szükség van a „time_accouting” csoportban egy „írás-olvasás” jogosultsággal rendelkező felhasználóra.

source: From Time Accounting menu choose "Settings".
hu: Az időelszámolás menüben válassza ki a „Beállítások” menüpontot.

source: Click on "Add Project" from the Actions list in the sidebar, located in the left part of the screen.
hu: Kattintson a „Projekt hozzáadása” gombra az oldalsávon lévő műveletek listában, amely a képernyő bal oldalán található.

source: In the new screen fill the name of the project and a description if needed (make sure that status is set to "valid").
hu: Az új képernyőn töltse ki a projekt nevét és a leírást, ha szükséges (győződjön meg arról, hogy az állapot „érvényes” értékre van-e állítva).

source: Click on "Submit" button.
hu: Kattintson az „Elküldés” gombra.

source: After the redirect to the main Settings window, notice that the new project appears in the project list in the center of the screen.
hu: A fő beállítások ablakra történő átirányítás után figyelje meg, hogy az új projekt megjelenik a projektlistában a képernyő közepén.

source: Optionally register more projects, repeating the same steps.
hu: Esetlegesen regisztráljon további projekteket az előző lépések megismétlésével.

source: Create A New Task
hu: Új feladat létrehozása

source: This example shows how to create a new task to register working hours on.
hu: Ez a sablon azt mutatja be, hogy hogyan lehet új feladatot létrehozni az azon történő munkaidő regisztrálásához.

source: Tasks are available to all projects.
hu: A feladatok elérhetők az összes projekthez.

source: Click on "Add Task" from the Actions list in the sidebar, located in the left part of the screen.
hu: Kattintson a „Feladat hozzáadása” gombra az oldalsávon lévő műveletek listában, amely a képernyő bal oldalán található.

source: In the new screen fill the name of the task (make sure that status is set to "valid").
hu: Az új képernyőn töltse ki a feladat nevét (győződjön meg arról, hogy az állapot „érvényes” értékre van-e állítva).

source: After the redirect to the main Settings window, notice that the new task appears in the task list in the center of the screen.
hu: A fő beállítások ablakra történő átirányítás után figyelje meg, hogy az új feladat megjelenik a feladatlistában a képernyő közepén.

source: Optionally register more tasks, repeating the same steps.
hu: Esetlegesen regisztráljon további feladatokat az előző lépések megismétlésével.

source: Add a User
hu: Felhasználó hozzáadása

source: This example shows how to add an agent to the time accounting.
hu: Ez a példa az mutatja be, hogy hogyan lehet egy ügyintézőt hozzáadni az időelszámoláshoz.

source: Select a user from the Actions list in the sidebar, located in the left part of the screen.
hu: Válasszon egy felhasználót az oldalsávon lévő műveletek listából, amely a képernyő bal oldalán található.

source: Click on "New user".
hu: Kattintson az „Új felhasználó” gombra.

source: In the new screen fill the comments if needed.
hu: Az új képernyőn töltse ki a megjegyzéseket, ha szükséges.

source: For this example we will leave unchecked "Show Overtime" and "Allow project creation" and we will use the default calendar.
hu: Ennél a példánál bejelölés nélkül fogjuk hagyni a „Túlóra megjelenítése” és a „Projektlétrehozás engedélyezése” jelölőnégyzeteket, és az alapértelmezett naptárat fogjuk használni.

source: In the period table choose a near date for "Period Begin" (otherwise the user will have to fill several time accounting records, due to the enforcement policy).
hu: Az időszak táblázatban válasszon egy közeli dátumot az „Időszak kezdetéhez” (különben a felhasználónak ki kell majd töltenie számos időelszámolási feljegyzést a kikényszerítési irányelv miatt).

source: Optionally change the "Period End" and leave all other columns with the defaults (for this example).
hu: Esetlegesen változtassa meg az „Időszak végét”, és hagyjon minden egyéb oszlopot alapértelmezetten (ennél a példánál).

source: After the redirect to the main Settings window, notice that the new user appears in the user list in the center of the screen.
hu: A fő beállítások ablakra történő átirányítás után figyelje meg, hogy az új felhasználó megjelenik a felhasználólistában a képernyő közepén.

source: Register Your Working Hours
hu: Munkaidő regisztrálása

source: This example shows how to register the working hours in time accounting.
hu: Ez a példa az mutatja be, hogy hogyan regisztrálni a munkaidőt az időelszámoláshoz.

source: A previously added user to time accounting is needed for this example. This user needs also at least "ro" permissions over "time_accouting" group.
hu: Az időelszámolásnál egy korábban hozzáadott felhasználó szükséges ehhez a példához. Ennek a felhasználónak legalább „csak olvasás” jogosultságok is szükségesek a „time_accouting” csoporton.

source: Login to OTRS with a proper user.
hu: Lépjen be az OTRS-be a megfelelő felhasználóval.

source: From Time Accounting menu choose "Edit".
hu: Az időelszámolás menüben válassza ki a „Szerkesztés” menüpontot.

source: Navigate to the desired date by using the left and right arrows in the "Date Navigation" widget located in the sidebar, at the left part of the screen (navigation is automatic by clicking the arrows). Alternatively a date can be defined with the controls below. Click on "Submit" button within the widget to go to the selected date.
hu: Navigáljon a kívánt dátumra a bal és jobb nyilak használatával az oldalsávban lévő „Dátum navigáció” felületi elemen a képernyő bal oldalán (a navigáció automatikus a nyilakra kattintva). Alternatívaként egy dátum meghatározható a lenti vezérlőkkel is. Kattintson az „Elküldés” gombra a felületi elemen belül a kiválasztott dátumra ugráshoz.

source: Select a project and task in the first row of the table in the central part of the screen.
hu: Válasszon egy projektet és egy feladatot a táblázat első sorában a képernyő középső részén.

source: Type a comment in the "Remarks" column.
hu: Gépeljen be egy megjegyzést az „Észrevételek” oszlopba.

source: Now fill the working hours. It can be done by setting the "Start" and "End" times in "HH:MM" format or register the period of time in the proper column.
hu: Most töltse ki a munkaidőt. Ezt a „Kezdés” és „Befejezés” idők beállításával lehet megtenni „ÓÓ:PP” formátumban, vagy regisztrálja az időszakot a megfelelő oszlopban.

source: Setting Working Hours For Two And A Half Hours
hu: Munkaidő beállítása két és fél órára
