Repository: OTRS/TimeAccounting
Catalog: doc/i18n/doc-TimeAccounting.*.po
Languages: hu

source: Lets think that the working hours took place from 11:00 AM to 01:30 PM. Set 11:00 for the "Start" column and 13:30 for the "End" column, or alternatively to this, just set 2.5 (two and a half hours) in the "Period" column.
hu: Képzelje el, hogy a munkaidő 11:00 órától 13:30-ig tart. Állítson be 11:00 órát a „Kezdés” oszlopba és 13:30-at a „Befejezés” oszlopba, vagy ennek alternatívájaként egyszerűen állítson be 2.5 értéket (két és fél óra) az „Időszak” oszlopba.

source: After setting working hours in one or more rows, make sure the "Total" (in the table footer) has the expected value, the sum of all working hours. Then click on "Submit" button on the lower part of the screen.
hu: A munkaidő egy vagy több sorba történő beállítása után győződjön meg arról, hogy az „Összesen” sor (a táblázat láblécében) az elvárt értékkel rendelkezik-e, az összes munkaidő összegével. Ezután kattintson az „Elküldés” gombra a képernyő alsó részén.

source: File List
hu: Fájllista

source: This list shows all included files and the referring permissions.
hu: Ez a lista jeleníti meg az összes tartalmazott fájlt és a hivatkozott jogosultságokat.

source: Tests
hu: Tesztek

source: This module has been tested on the current state of the art in quality.
hu: Ezt a modult a jelenlegi legkorszerűbb minőségben tesztelték.

source: Test Cases
hu: Tesztesetek

source: To test this package please follow the examples described in the "Usage" section. All the tests cases should return the expected results defined at the beginning of each example.
hu: A csomag teszteléséhez kövesse a „Használat” szakaszban bemutatott példákat. Az összes tesztesetnek az elvárt eredményekkel kell visszatérnie, ahogy az egyes példák elején meg van határozva.

source: Unit Tests
hu: Egységtesztek

source: To ensure the quality of the module, several so-called unit tests were created, to test the functionalities of this module. These unit tests can be run via command line.
hu: A modul minőségének biztosításához számos, úgynevezett egységtesztet hoztak létre a modul funkcionalitásainak teszteléséhez. Ezek az egységtesztek parancssoron keresztül futtathatók.

source: ATTENTION: Please never run unit tests on a productive system, since the added test data to the system will no longer be removed. Always use a test system.
hu: FIGYELEM: soha ne futtasson egységteszteket egy termelési rendszeren, mivel a rendszerhez hozzáadott tesztadatok többé nem lesznek eltávolíthatók. Mindig tesztrendszert használjon.

source: Run the package specific unit tests
hu: A csomagra jellemző egységtesztek futtatása

source: To run only the unit test which will be delivered with this package, use the following command on the command line:
hu: Csak azon egységtesztek futtatásához, amelyet ez a csomag fog szállítani, használja a következő parancsot a parancssorban:

source: Selenium unit tests
hu: Selenium egységtesztek

source: To run the Selenium unit tests, make sure you have a complete Selenium environment setup in your Kernel/Config.pm file and a running a WebDriver.
hu: A Selenium egységtesztek futtatásához győződjön meg arról, hogy rendelkezik-e a teljes Selenium környezet beállításával a Kernel/Config.pm fájlban, és van-e futó WebDriver illesztőprogramja.

source: Run all available unit tests
hu: Az összes elérhető egységteszt futtatása

source: To run all available unit tests, use the following command on the command line:
hu: Az összes elérhető egységteszt futtatásához használja a következő parancsot a parancssorban:

source: ChangeLog
hu: Változásnapló
